using Microsoft.AspNetCore.Mvc;
using Sample_CV.Models;

namespace Sample_CV.Components
{
    public class MyInfoViewComponent: ViewComponent
    {
       public IViewComponentResult Invoke()
        {
            AboutMe Me = new AboutMe()
            {
                Name = "مرضیه فاطمی",
                JobTitle = "کارآفرین، محقق، طراح و برنامه نویس نرم افزار",
                Description = "من شخصـیتا انسانی هستم که بسیار علاقه مند به یادگیری و رشد و انجام کارهای ارزشمند هستم. 6 سال سابقه طراحی و تولید نرم افزار دارم که شامل طراحی و ساخت نرم افزارهای زیر از صـفر تا صد بوده است. یعنی از بررسـی و تحقیق پیرامون چیستی محصول و کارهای رقبا، تا تحقیق پیرامون اصول علمی پشت آن و پیاده سازی ان، تا طراحی نرم افزار و تا نوشتن کد و اتصال آن به سخت افزار ( بخش رابط ) و حتی در برخی از آنهـا ارائه ی طرح کلی به تیم سـخت افزار برای طراحی و پیاده سازی جملگی به طور اکمل به عهـده ی بنـده بوده است. هم سابقه ی کار فردی دارم و هم سابقه مدیریت تیم و مدیریت محصول را دارم. با نحوه مدیریت تیم در محیط های نرم افزاری مثل ترلو و با شیوه های agile آشنایی دارم. سه سال پیش یک سامانه مشاوره انلاین های اکسپرت را راه اندازی کردم که کلیه فعالیتهای بیزینسی، مارکتی، استخدام مشاورین و کارکنان و نظارت بر عملکرد آنها و مسائل راهبردی کلان بیزینس را خودم مدیریت می کردم . به همین دلیل علاوه بر کار برنامه نویسی به مدیریت محصولی نیز علاقه مند هستم و انعطاف لازم را متناسب با شرایط شغلی دارم.",
           
                Products = new string[2] {"یک پنجره","HiExpert سامانه مشاوره انلاین"},
            Image ="me.jpg",
            };
            return View("_MyInfo",Me);
        }
    }
}
