using Microsoft.AspNetCore.Mvc;
using Sample_CV.Models;

namespace Sample_CV.Components
{
    public class ProjectsViewComponent : ViewComponent
    {
        public IViewComponentResult Invoke()
        {

            List<Project> MyProjects = new List<Project>
            {
            new Project(1,"نرم افزار نوروفیدبک و بیوفیدبک","در ان امواج معزی که به صورت realtime و با دقت میلی ثانیه از کاربر در حال ریکورد است از طریق دستگاه به طریق usb ، wifi ، بلوتوث به نرم افزار منتقل می شد سپس در نرم افزار انالیز تخصصی پردازش سیگنال روی ان انجام می گرفت که شامل اعمال فیلترهای مختلف و محاسبات ریاضی بود. سپس در قالب بازی و نیز نمودارهای متحرک برای کاربر به نمایش در می آمد. کار متشکل از مالتی تردینگ بود. کار کاملا object oriented بود و لایه های مختلف جدا بود. لایه های مربوط به دریافت داده از نمایش داده جدا بود. لایه های آنالیز و نهایتا بخش نمایش همه تفکیک شده و جدا بودند. یکی از مهم ترین ویژگی های کار این بود که ما از قابلیت های رایج ویندوز فرم در سی شارپ استفاده نمی کردیم و برای اینکه نرم افزار قابلیت گسترش داشته باشد تمامی پنل ها را از صفر خودمان می ساختیم. پنل ها به شیوه درگ و دراپ قابل ساخت، جابجایی، تغییر سایز، پاک کردن، کپی پیست و حتی ctrl z , ctrl y بودند به طوری که یک نرم افزار انعطاف پذیر پایه داشته باشیم که روی ان انواع نرم افزار ها را سوار کنیم.","Sbimed.com","project1.png"),
             new Project(2,"نرم افزار brainmap","در این نرم افزار داده های19 کاناله ی مغزی از فرد گرفته شده و روی یک دایره که نماد سر است به صورت رنگی به نسبت هم نمایش داده می شود و این رنگ ها به صورت realtime تغییر می کند. برای این منظور از یک سری توابع ریاضی مثل cubic sbline و گاوسی استفاده کردم که نه تنها کل 14 کانال را به نسبت هم مقیاس می کرد بلکه فواصل بین 19 نقطه را پر می کرد تا یک طیف پیوسته رنگی ایجاد کند که به صورت realtime و در واحد میلی ثانیه متناسب با سیگنالهای مغزی فرد اپدیت شود. هم چنین اندازه ی دایره ها توسط کاربر با درگ و دراپ قابل تغیر بود. این بخشها نیازمند توابع و الگوریتم های ریاضی بودند که همگی را مطالعه، تحقیق و پیاده سازی کردم.","sbimed.com","project2.png"),
              new Project(3,"نرم افزار hrv training biofeedback","این نرم افزار را از صفر تا صد یعنی از طراحی و تحقیق پیرامون اینکه محصول چیست، تا طراحی نرم افزار و کد نویسی و پیاده سازی به تنهایی انجام دادم. موارد شامل دریافت سیگنالهای قلبی و تنفسی و اعمال یک سری پردازش های سیگنالی و ریاضی روی داده و نمایش ان به صورت نمودار بود که به صورت realtime و متناسب با سیگنالهای کاربر در صفحه نمایش داده می شد. علاوه بر این انالیز ها به خورد یک پنل game هم برای بازی داده می شد.","sbimed.com","project3.png"),
              new Project(4,"نرم افزار EEG ویژه بیمارستان"," این نرم افزار را از صفر تا صد یعنی از طراحی و تحقیق پیرامون اینکه محصول چیست، تا طراحی نرم افزار و کد نویسی و پیاده سازی به تنهایی انجام دادم. این بخش شامل یک اسکوپ بود که همزمان با تغییر ماژول سیگنالهای 19 کاناله را با ترکیب ریاضی خاصی که ماژول تعریف می کرد نمایش می دهد، و با درخواست کاربر برای پرینت ارسال می کند. هم چنین یک ایونت تریگر نوری دارد که وقتی روشن می شود همزمان دستگاه برای نرم افزار می فرسترد. این ایونت را به صورت سنکرون در پک ارسال داده دریافت می کنیم و با دقت میلی ثانیه سنکرون شده با داده در اسکوپ نمایش می دهیم.زمان این تریگرها به همراه داده ذخیره می شد.","sbimed.com","project4.png"),

            };

            return View("PView",MyProjects); 
        }
    }
}
